<?php 

/*
 * Title and SKU are required.
 * Price and Stock are optional.
 * All empty fields have a default value.
 *
 */

$products = array(
    ["title" => "Free", "sku" => "free-11", "stock"=> 10, "short_desc"=> "Η συρταριέρα Free μινιμαλιστικού σχεδιασμού, ιδιαίτερα λειτουργική με την προέκταση γραφείου και τη δυνατότητα περιστροφής αυτού. Παράγεται από ξύλο δρυός και οξυάς σε διάφορες διαστάσεις και αποχρώσεις."],
    ["title" => "Αφροδίτη", "sku" => "afroditi-11", "stock"=> 10, "short_desc"=> "Κονσόλα Αφροδίτη ιδιαίτερου σχεδιασμού, με χαρακτηριστικό γνώρισμα το συνδυασμό κυβιστικής επιφάνειας και καλλίγραμμης 'πλεκτής' βάσης. Είναι κατασκευασμένη από ξύλο οξυάς και καρυδιάς με προαιρετική χρήση πατίνας."],
    ["title" => "Beluga", "sku" => "beluga-11", "stock"=> 10, "short_desc"=> "Κονσόλα σε νεομπαρόκ σχεδιασμό με την χρήση ασημοπατίνας στην κολώνα της, όπως και στον καθρέπτη. Κατασκευασμένη από ξύλο δρυός, σε πολλούς χρωματισμούς. Οι διαστάσεις της είναι 120x40x80cm ύψος."],
    ["title" => "Chanel", "sku" => "chanel-11", "stock"=> 10, "short_desc"=> "Αφαιρετικού σχεδιασμού κονσόλα. Κατασκευασμένη από ξύλο δρυός, σε πολλούς χρωματισμούς.Οι διαστάσεις της είναι 120x42x170cm ύψος."],
    
    ["title" => "Forest", "sku" => "forest-11", "stock"=> 10, "short_desc"=> "Κονσόλα-πορτ μαντό, με ιδιαίτερα εργονομικό σχεδιασμό και δυνατότητα ύπαρξης σκαμπό. Κατασκευασμένη από ξύλο δρυός με δυνατότητα επιλογής του χρωματισμού και απεριόριστων διαστάσεων."],
    ["title" => "Nova", "sku" => "nova-11", "stock"=> 10, "short_desc"=> "Κονσόλα με ιδιαίτερα μοντέρνα, εκκεντρική σχεδίαση. Υπάρχει η δυνατότητα κατασκευής ταμπουρέ στο κάτω μέρος της. κατασκευάζεται από ξύλο δρυός σε πολλές αποχρώσεις. Διαστάσεις: 130x35cm."],
    ["title" => "Morosso", "sku" => "morosso-11", "stock"=> 10, "short_desc"=> "Συρταριέρα κυβιστικού σχεδιασμού με δυνατότητα κίνησης στο άνω δεξιό τμήμα και χρήση καθίσματος στο δημιουργούμενο κενό. Διατίθεται σε διάφορες αποχρώσεις και διαστάσεις."],
    ["title" => "Avallon", "sku" => "avallon-11", "stock"=> 10, "short_desc"=> "Συρταριέρα με αίσθηση κίνησης στα συρτάρια και «παιχνιδιάρικους» κυκλικούς καθρέπτες. Παράγεται σε απεριόριστο αριθμό αποχρώσεων ξύλου ή λάκας και σε απεριόριστο αριθμό διαστάσεων."],
    ["title" => "Royal", "sku" => "royal-11", "stock"=> 10, "short_desc"=> "Ιδιαίτερα πρακτική συρταριέρα με δυνατότητα αποθήκευσης ψηλών αντικειμένων στο αριστερό κενό και ολόσωμο καθρέπτη με ειδικά ράφια για ψιλοαντικείμενα. Παράγεται σε απεριόριστο αριθμό αποχρώσεων και διαστάσεων."],
    
    ["title" => "Caprice", "sku" => "caprice-11", "stock"=> 10, "short_desc"=> "Συρταριέρα από ξύλο καρυδιάς και λάκα στις μετώπες των συρταριών, με πρακτικό κάθετο πορτάκι στο δεξιό τμήμα και διατίθεται σε διάφορες αποχρώσεις. Έχει διαστάσεις 80x45x105cm."],
    ["title" => "Loft", "sku" => "loft-11", "stock"=> 10, "short_desc"=> "Ιδιαιτέρως πρακτική τουαλέτα με καθρέπτη 'μακιγιάζ' και 4 χώρους για μικροαντικείμενα. Έχει διαστάσεις 120x41x80 εκ. Το συμπληρωματικό σκαμπό όπως και η τουαλέτα διατίθενται σε διάφορες αποχρώσεις."],
    ["title" => "Mirror", "sku" => "mirror-11", "stock"=> 10, "short_desc"=> "Κονσόλα ή ολόσωμος καθρέπτης με ενσωματωμένο ράφι. Διαστάσεις: 60x70cm, με δυνατότητα μετατροπής αυτών.."],
    ["title" => "Life", "sku" => "life-11", "stock"=> 10, "short_desc"=> "Συρταριέρα από ξύλο καρυδιάς ή δρυός, με κύριο χαρακτηριστικό τις «σκαμμένες» μετώπες των συρταριών της σε σχήμα Γ. Διατίθεται σε διάφορες αποχρώσεις. Διαστάσεις: 60x45x107cm."],
    ["title" => "Kare", "sku" => "kare-11", "stock"=> 10, "short_desc"=> "Κονσόλα μοντέρνα, λιτής γραμμής. Κατασκευασμένη από ξύλο δρυός σε πολλούς χρωματισμούς και απεριόριστων διαστάσεων. Διαστάσεις: Δυνατότητα επιλογής απεριόριστων διαστάσεων."],
    
    ["title" => "Medina", "sku" => "medina-11", "stock"=> 10, "short_desc"=> "Κονσόλα με λιτό, μοντέρνο σχεδιασμό. Κατασκευάζεται από ξύλο δρυός, με απεριόριστες επιλογές χρωματισμών με δυνατότητα τροποποίησης. Διαστάσεις: 140x35cm."],
    ["title" => "Valentino", "sku" => "valentino-11", "stock"=> 10, "short_desc"=> "Κονσόλα σε λιτή, μοντέρνα γραμμή. Κατασκευασμένη από ξύλο δρυός. Ο χρωματισμός του ξύλου είναι επιλογή του πελάτη.Οι συγκεκριμένες διαστάσεις της είναι 140x40, μπορεί όμως να κατασκευαστεί ανάλογα με τις ανάγκες κάθε πελάτη."],
    ["title" => "Αντιγόνη", "sku" => "antigoni-11", "stock"=> 10, "short_desc"=> "Κλασική κονσόλα με ιδιαίτερα εντυπωσιακές μπροστινές κολώνες «αρχαιοελληνικού» ρυθμού, από ξύλο οξυάς και καρυδιάς με λεπτομέρειες χρυσής και σοκολατί πατίνας. Έχει διαστάσεις 120x36x83cm."],
    ["title" => "Valentino", "sku" => "valentino-11", "stock"=> 10, "short_desc"=> "Νεοκλασική κονσόλα ή διαχωριστικό από ξύλο οξυάς και καρυδιάς, με συνδυασμό μαρκεντερί και ρίζας ξύλου στην επιφάνεια της και στις μετώπες των συρταριών. Διαστάσεις:128x41x80cm ύψος."],
    ["title" => "Πάτμος", "sku" => "patmos-11", "stock"=> 10, "short_desc"=> "Κονσόλα κλασική με κομψό, καμπυλωτό σχεδιασμό. Κατασκευάζεται από ξύλο οξυάς και καρυδιάς. Ο τελικός χρωματισμός είναι επιλογής του πελάτη. Διαστάσεις: 130x45x84cm ύψος."],
    ["title" => "Κλεοπάτρα", "sku" => "kleopatra-11", "stock"=> 10, "short_desc"=> "Νεοκλασική κονσόλα και καθρέπτης. Κατασκευασμένα από ξύλο οξυάς, με απεριόριστη επιλογή χρωματισμού. Διαστάσεις: 95x45x180cm ύψος."],
    
    ["title" => "Margot", "sku" => "margot-11", "stock"=> 10, "short_desc"=> "Κονσόλα σε νεομπαρόκ ύφος με ασημοπατίνα. Κατασκευασμένη από ξύλο οξυάς. Διαστάσεις: 180x80x79cm."],
    ["title" => "Orazio", "sku" => "orazio-11", "stock"=> 10, "short_desc"=> "Κλασικό κομό από ξύλο οξυάς με εντυπωσιακά σκαλίσματα και ιδιαίτερα κυματιστά συρτάρια και διατίθεται σε όλες τις αποχρώσεις ξύλου ή πατίνας. Διαστάσεις:134x51x84cm ύψος."],
    ["title" => "Tsar", "sku" => "tsar-11", "stock"=> 10, "short_desc"=> "Κονσόλα κλασικού σχεδιασμόυ από ξύλο οξυάς, με ιδιαίτερα εντυπωσιακά σκαλίσματα και πόμολα. Διατίθεται σε όλες τις αποχρώσεις ξύλου και πατίνας. Διαστάσεις: 148x54x101cm ύψος."],
    ["title" => "Vivre", "sku" => "vivre-11", "stock"=> 10, "short_desc"=> "Κλασική κονσόλα από ξύλο οξυάς, συνδυάζεται και ως τουαλέτα μαζί με αντίστοιχα κομοδίνα σε κρεβατοκάμαρα και διατίθενται σε όλες τις αποχρώσεις ξύλου και πατίνας. Διαστάσεις: 134x51x93cm και των κομοδίνων 61x28x72cm."],
    ["title" => "Cube", "sku" => "cube-11", "stock"=> 10, "short_desc"=> "Iδιαίτερου σχεδιασμού συρταριέρα απο ξύλο δρυος με λεπτομέρειες σε λάκα.Χρώματα επιλογής σας.Διαστάσεις 130Χ45Χ66 ύψος."],
    ["title" => "Joy", "sku" => "joy-11", "stock"=> 10, "short_desc"=> "Πολυμορφική συρταριέρα από ξύλο δρυος και λεπτομέρεια σε λάκα με ολόσωμο καθρέπτη.Διαστάσεις 160Χ45Χ69.."],
    
    ["title" => "Liberty", "sku" => "liberty-11", "stock"=> 10, "short_desc"=> "Συρταριέρα με αναφορές στα sixty's από ξύλο δρυς και λάκα.Διαστάσεις 120Χ45Χ76."],
    ["title" => "Line", "sku" => "line-11", "stock"=> 10, "short_desc"=> "Συρταριέρα συνδυασμένη με ολόσωμο καθρέπτη .Από ξύλο δρυός σε πολλές αποχρώσεις και διάσταση 110Χ40Χ175."],
    ["title" => "Princess", "sku" => "princess-11", "stock"=> 10, "short_desc"=> "Συρταριέρα και ολόσωμος καθρέπτης σε νεομπαρόκ ύφος από ξύλο δρυς και διακριτική χρήση πατίνας.Ο ολόσωμος καθρέπτης διαθέτει και αποθηκευτικό χώρο .Διαστάσεις 115Χ41Χ175 ύψος."],
    ["title" => "Sixty's", "sku" => "sixtys-11", "stock"=> 10, "short_desc"=> "Συρταριέρα με αναφορές στα sixty's από ξύλο δρυς και λάκα.Διάσταση 130Χ45Χ69."],
    ["title" => "Ερατώ", "sku" => "erato-11", "stock"=> 10, "short_desc"=> "Κονσόλα και πολυθρόνα ''Ερατώ'' από ξύλο οξυάς με δυνατότητα επιλογής αποχρώσεων και υφασμάτων."]
);

function insertProductTest($data){
    /* If there is no title & no SKU -> Stop */
    if (!isset($data['title']) || empty($data['title'])) {
        return false;
    }
    if (!isset($data['description'])) $data['description'] = '';
    if (!isset($data['status'])) $data['status'] = 'draft';

    if (!wc_get_product_id_by_sku($data['sku'])) {

        $post_id = wp_insert_post(array(
            'post_title' => $data['title'],
            'post_name' => sanitize_title($data['title']),
            'post_content' => $data['description'],
            'post_excerpt'   => $data['short_desc'],
            'post_status' => $data['status'],
            'post_type' => 'product',
        ));
        
        /* 
        Easier to undestand Way

        $my_post = array(
            'post_title' => $data['title'],
            'post_name' => sanitize_title($data['title']),
            'post_content' => $data['description'],
            'post_excerpt'   => $data['short_desc'],
            'post_status' => $data['status'],
            'post_type' => 'product',
        );
        $post_id = wp_insert_post($my_post);
        */

        wp_set_object_terms($post_id, 'simple', 'product_type');
        update_post_meta($post_id, '_sku', $data['sku']);

        echo "Product with ID:" . $post_id . " and SKU:". $data['sku'] ." added! <br/>";

    } else {
        echo "Sku:" . $data['sku'] . " allready exists!";
    }
    return true;
}


/* Allow only this link to run the script and loop */
if ($_SERVER['REQUEST_URI'] == "/kokkoris/prod") {
    foreach ($products as $data) {
        insertProductTest($data);
    }
    echo "All done!";
    die();
}